TensorFlowFoam/misc/Other_models/ML_RNG/RNG_Run/0/Cy
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "5024";
    object      Cy;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   nonuniform List<scalar> 
20540
(
0.0127133
0.0127133
0.0127425
0.0127425
0.012778
0.012778
0.0128208
0.0128208
...
)
;

boundaryField
{
    inlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
65
(
0.0127133
0.0127425
0.012778
0.0128208
0.0128727
0.0129354
0.0130113
0.0131031
...
)
;
    }
    outlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
113
(
3.22905e-05
9.96743e-05
0.000172907
0.000252496
0.000338992
0.000432997
0.000535161
0.000646192
...
)
;
    }
    lowerWallStartup
    {
        type            symmetryPlane;
    }
    upperWallStartup
    {
        type            symmetryPlane;
    }
    upperWall
    {
        type            calculated;
        value           nonuniform List<scalar> 
218
(
0.1143
0.1143
0.1143
0.1143
0.1143
0.1143
0.1143
0.1143
...
)
;
    }
    lowerWall
    {
        type            calculated;
        value           nonuniform List<scalar> 
266
(
0.0127
0.0127
0.0127
0.0127
0.0127
0.0127
0.0127
0.0127
...
)
;
    }
    front
    {
        type            empty;
    }
    back
    {
        type            empty;
    }
}


// ************************************************************************* //
