TensorFlowFoam/misc/Other_models/ML_RNG/RNG_Run/system/stressComponents
type            turbulenceFields;
libs            ("libfieldFunctionObjects.so");
writeControl    writeTime;
fields         (R devReff nuEff);
